IRP/src/Enums/AutostartProcessTypes/AutostartProcessTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AutostartProcessTypes</name>
  <enumValues>
    <name>NotUsed</name>
  </enumValues>
  <enumValues>
    <name>WhenCreating</name>
  </enumValues>
  <enumValues>
    <name>WhenPosting</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/ExecutionTemplates/ExecutionTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExecutionTemplates</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ReadyToStartProcesses</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ExecutionObjects</name>
    <attributes>
      <name>ObjectType</name>
      <type>
        <types>CatalogRef.ConfigurationMetadata</types>
      </type>
    </attributes>
    <attributes>
      <name>AutostartProcesses</name>
      <type>
        <types>EnumRef.AutostartProcessTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ExecutionStages</name>
    <attributes>
      <name>StageID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_en</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_hash</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_ru</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_tr</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>TasksStartTogether</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TasksResult</name>
      <type>
        <types>EnumRef.TaskResults</types>
      </type>
    </attributes>
    <attributes>
      <name>TasksFailAction</name>
      <type>
        <types>EnumRef.TaskFailActions</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesTasks</name>
    <attributes>
      <name>StageID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>TaskID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_en</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_hash</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_ru</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_tr</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Executor</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>UserGroup</name>
      <type>
        <types>CatalogRef.UserGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>CatalogRef.EmployeePositions</types>
      </type>
    </attributes>
    <attributes>
      <name>Branch</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ProfitLossCenter</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>Detailing</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TaskType</name>
      <type>
        <types>EnumRef.TaskTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AutoExecuteOnStartup</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/BusinessProcessesServer/Module.bsl
Procedure OnWrite_ExecutionObjectOnWrite(Source, Cancel) Export
	
	ObjectTypeRef = CatConfigurationMetadataServer.GetConfigurationMetadataItemByObject(Source);
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	ExecutionTemplatesExecutionObjects.Ref
	|FROM
	|	Catalog.ExecutionTemplates.ExecutionObjects AS ExecutionTemplatesExecutionObjects
	|WHERE
	|	ExecutionTemplatesExecutionObjects.ObjectType = &ObjectType
	|	AND ExecutionTemplatesExecutionObjects.Ref.ReadyToStartProcesses
	|	AND ExecutionTemplatesExecutionObjects.AutostartProcesses = VALUE(Enum.AutostartProcessTypes.WhenCreating)";
	
	Query.SetParameter("ObjectType", ObjectTypeRef);
	
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		ProcessRef = BusinessProcesses.ExecutionProcesses.FindStartedProcess(Source.Ref, QuerySelection.Ref);
		If ValueIsFilled(ProcessRef) Then
			Continue;
		EndIf;
		
		NewProcess = BusinessProcesses.ExecutionProcesses.CreateBusinessProcess();
		NewProcess.Fill(QuerySelection.Ref);
		NewProcess.ExecutionObject = Source.Ref;
		NewProcess.Write();
		NewProcess.Start();
	EndDo;
	
EndProcedure

Procedure OnPosting_ExecutionObjectPosting(Source, Cancel, PostingMode) Export
	
	ObjectTypeRef = CatConfigurationMetadataServer.GetConfigurationMetadataItemByObject(Source);
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	ExecutionTemplatesExecutionObjects.Ref
	|FROM
	|	Catalog.ExecutionTemplates.ExecutionObjects AS ExecutionTemplatesExecutionObjects
	|WHERE
	|	ExecutionTemplatesExecutionObjects.ObjectType = &ObjectType
	|	AND ExecutionTemplatesExecutionObjects.Ref.ReadyToStartProcesses
	|	AND ExecutionTemplatesExecutionObjects.AutostartProcesses = VALUE(Enum.AutostartProcessTypes.WhenPosting)";
	
	Query.SetParameter("ObjectType", ObjectTypeRef);
	
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		ProcessRef = BusinessProcesses.ExecutionProcesses.FindStartedProcess(Source.Ref, QuerySelection.Ref);
		If ValueIsFilled(ProcessRef) Then
			Continue;
		EndIf;
		
		NewProcess = BusinessProcesses.ExecutionProcesses.CreateBusinessProcess();
		NewProcess.Fill(QuerySelection.Ref);
		NewProcess.ExecutionObject = Source.Ref;
		NewProcess.Write();
		NewProcess.Start();
	EndDo;
	
EndProcedure
